In [2]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

from sqlalchemy import text

In [3]:
import getpass
password = getpass.getpass()

In [4]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [10]:
# 1. How many copies of the film Hunchback Impossible exist in the inventory system?
query = '''SELECT count(inventory_id) AS number_of_copies FROM inventory
		WHERE film_id LIKE (
			SELECT film_id FROM film
			WHERE title LIKE 'Hunchback Impossible');'''
pd.read_sql_query(query, engine)

   number_of_copies
0                 6

In [8]:
# 2. List all films whose length is longer than the average of all the films.
query = '''SELECT title, length FROM film
        WHERE length > (
	    SELECT round(AVG(length),2) AS average FROM film);'''
pd.read_sql_query(query, engine)

                title  length
0    AFFAIR PREJUDICE     117
1         AFRICAN EGG     130
2        AGENT TRUMAN     169
3     ALAMO VIDEOTAPE     126
4      ALASKA PHANTOM     136
..                ...     ...
484      WORST BANGER     185
485        WRATH MILE     176
486    WRONG BEHAVIOR     178
487    YOUNG LANGUAGE     183
488        YOUTH KICK     179

[489 rows x 2 columns]

In [11]:
# 3. Use subqueries to display all actors who appear in the film Alone Trip.
query = '''SELECT first_name, last_name FROM actor
        WHERE actor_id IN(
	    	SELECT actor_id FROM film_actor
	    	WHERE film_id IN(
				SELECT film_id FROM film
				WHERE title LIKE 'Alone Trip'));'''
pd.read_sql_query(query, engine)

  first_name last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP
5      CHRIS      DEPP
6   LAURENCE   BULLOCK
7      RENEE      BALL

In [12]:
# 4. Sales have been lagging among young families, and you wish to target all family movies for a promotion. 
# Identify all movies categorized as family films.
query = '''SELECT title FROM film
        WHERE film_id IN(
	        SELECT film_id FROM film_category
	        WHERE category_id IN (
		        SELECT category_id FROM category
		        WHERE name LIKE 'Family'));'''
pd.read_sql_query(query, engine)

               title
0        AFRICAN EGG
1      APACHE DIVINE
2     ATLANTIS CAUSE
3    BAKED CLEOPATRA
4          BANG KWAI
..               ...
64       SPLASH GUMP
65      SUNSET RACER
66     SUPER WYOMING
67  VIRTUAL SPOILERS
68      WILLOW TRACY

[69 rows x 1 columns]

In [14]:
# 5. Get name and email from customers from Canada using subqueries. 
query = '''SELECT first_name, last_name, email from customer 
        where address_id IN 
            (SELECT address_id from address 
            where city_id IN 
                (SELECT city_id from city 
                where country_id = 
                    (SELECT country_id from country 
                    where country = 'Canada')));'''
pd.read_sql_query(query, engine)

  first_name  last_name                                 email
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org

In [5]:
# Do the same with joins. Note that to create a join, you will have to identify the correct tables with their primary keys 
# and foreign keys, that will help you get the relevant information.
query = '''SELECT cs.first_name, cs.last_name, cs.email FROM customer AS cs
            JOIN address AS a
            ON cs.address_id = a.address_id
	        JOIN city AS ct
	        ON a.city_id = ct.city_id
		    JOIN country AS c
		    ON ct.country_id = c.country_id
		    WHERE c.country LIKE 'Canada';'''
pd.read_sql_query(query, engine)

  first_name  last_name                                 email
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org

In [23]:
# 6. Which are films starred by the most prolific actor? 
# Most prolific actor is defined as the actor that has acted in the most number of films. 
# First you will have to find the most prolific actor and then use that actor_id to find the different films that he/she starred.
query = '''SELECT film_id, title FROM sakila.film
        WHERE film_id IN (
            SELECT film_id FROM film_actor
            WHERE actor_id = (
                SELECT actor_id FROM (
                    SELECT actor_id, count(film_id) as number_films FROM sakila.film_actor
                    GROUP BY actor_id
                    ORDER BY number_films DESC
                    LIMIT 1) AS table1));'''
pd.read_sql_query(query, engine)

    film_id                    title
0        62             BED HIGHBALL
1       112        CALENDAR GUNFIGHT
2       133          CHAMBER ITALIAN
3       136          CHAPLIN LICENSE
4       138      CHARIOTS CONSPIRACY
5       162          CLUELESS BUCKET
6       165      COLDBLOODED DARLING
7       172        CONEHEADS SMOOCHY
8       209             DARKNESS WAR
9       220           DEER VIRGINIAN
10      239             DOGMA FAMILY
11      277          ELEPHANT TROJAN
12      292           EXCITEMENT EVE
13      338           FRISCO FORREST
14      348              GANDHI KWAI
15      369        GOODFELLAS SALUTE
16      388            GUNFIGHT MOON
17      392             HALL CASSIDY
18      409     HEARTBREAKERS BRIGHT
19      430            HOOK CHARIOTS
20      445              HYDE DOCTOR
21      454           IMPACT ALADDIN
22      458              INDIAN LOVE
23      467           INTRIGUE WORST
24      520          LICENSE WEEKEND
25      534          LOUISIANA HARRY
26      548       MAGNIFICENT CHITTY
27      571         METAL ARMAGEDDON
28      574        MIDNIGHT WESTWARD
29      603        MOVIE SHAKESPEARE
30      606          MUMMY CREATURES
31      637             OPEN AFRICAN
32      774           SEARCHERS WAIT
33      781              SEVEN SWARM
34      796            SIERRA DIVIDE
35      831      SPIRITED CASUALTIES
36      849          STORM HAPPINESS
37      859              SUGAR WONKA
38      879         TELEGRAPH VOYAGE
39      905  TRAINSPOTTING STRANGERS
40      973                WIFE TURN
41      977              WINDOW SIDE

In [24]:
# 7 Films rented by most profitable customer. 
# You can use the customer table and payment table to find the most profitable customer ie the customer that has made the largest sum of payments
query = '''SELECT film_id, title FROM sakila.film
        WHERE film_id IN (
                SELECT film_id FROM sakila.inventory
                WHERE inventory_id IN (
                        SELECT inventory_id FROM sakila.rental
                        WHERE customer_id IN (
                                SELECT customer_id FROM (
                                        SELECT customer_id, sum(amount) as sum_amount FROM payment
                                        GROUP BY customer_id
                                        ORDER BY sum_amount DESC
                                        LIMIT 1) as table1)));'''
pd.read_sql_query(query, engine)

    film_id                  title
0       226       DESTINY SATURDAY
1       201         CYCLONE FAMILY
2       810             SLUMS DUCK
3       313         FIDELITY DEVIL
4       832            SPLASH GUMP
5       583      MISSION ZOOLANDER
6       605       MULHOLLAND BEAST
7       698         PRINCESS GIANT
8       658          PARIS WEEKEND
9       709              RACER EGG
10      966         WEDDING APOLLO
11       70       BIKINI BORROWERS
12      736         ROBBERY BRIGHT
13      835               SPY MILE
14      597        MOONWALKER FOOL
15      571       METAL ARMAGEDDON
16      730    RIDGEMONT SUBMARINE
17      415            HIGH ENCINO
18      263           DURHAM PANKY
19      349            GANGS PRIDE
20      213             DATE SPEED
21      412     HEAVYWEIGHTS BEAST
22      262             DUMBO LUST
23      367        GOLDMINE TYCOON
24      285       ENGLISH BULWORTH
25       99    BRINGING HYSTERICAL
26      330  FORRESTER COMANCHEROS
27      716        REAP UNFAITHFUL
28      223           DESIRE ALIEN
29      529        LONELY ELEPHANT
30       68          BETRAYED REAR
31      800       SINNERS ATLANTIS
32      456               INCH JET
33      327       FOOL MOCKINGBIRD
34       83         BLUES INSTINCT
35      724         REMEMBER DIARY
36      461          INSECTS STONE
37      678         PICKUP DRIVING
38      884        TERMINATOR CLUB
39      564          MASSAGE IMAGE
40      578            MILLION ACE
41      707        QUEST MUSSOLINI
42      631       NOVOCAINE FLIGHT
43      846         STING PERSONAL

In [40]:
# 8 Customers who spent more than the average payments
query = '''SELECT customer_id, sum(amount) AS total_spent FROM payment 
            GROUP BY customer_id
            HAVING sum(amount) > (
		        SELECT round(AVG(amount),2) AS avg_payment FROM payment)
                ORDER BY sum(amount) DESC;'''
pd.read_sql_query(query, engine)

     customer_id  total_spent
0            526       221.55
1            148       216.54
2            144       195.58
3            137       194.61
4            178       194.61
..           ...          ...
594           97        58.82
595          395        57.81
596          318        52.88
597          281        50.86
598          248        50.85

[599 rows x 2 columns]